#Дана строка words, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов.
#words = ("f g h y g g t h f f r")

result = print(len((words.split(' '))))